#+Title: Programming Fundamentals
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2023-08-21
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH_msv


* One Class, many Objects
#+begin_src java :file Car
  public class Car {
    private String myPlate;
    private String myColour;

    Car(String theLicensePlate, String theColour) {
      myPlate = theLicensePlate;
      myColour = theColour;
    }

    public String toString() {
      return "a " + myColour + " car with license plate " + myPlate;
    }
  }
#+end_src

#+RESULTS:
: success

#+begin_src java
  Car c1 = new Car("aaa111", "red");
  Car c2 = new Car("bbb222", "yellow");
  System.out.println(c1);
  System.out.println(c2);
#+end_src

#+RESULTS:
: a red car with license plate aaa111
: a yellow car with license plate bbb222


* Parameters, Attributes, Local Variables
- Attributes are defined in the class
- Attributes have one value for each object
- e.g. ~Car.myColour~ ; each object of the type Car has its own value:
  - ~c1.myColour == "red"~
  - ~c2.myColour == "yellow"~
- Attributes can be defined with a start value.
- Attributes may be changed in methods.

- Parameters are defined as part of a method,
- Parameters have one value each time the method is called.
- The value is "given" by the calling method.
  - e.g. ~theCar.calculateFuelConsumption(theCar.getCurrentDistance(), 40) // current distance in km, 40 litres~

- The value can change within the method, but this does not change the value in the caller.
- Parameters are essentially /Local Variables/ whose value is defined elsewhere.
- Parameters /can not/ be defined with a default value.

- Local variables are definied anywhere inside a method.
- Local variables are only usable /from that point onwards/
- Local variables can be defined with a start value.
- Local variables can change within the method.
- Local variables are, in fact, valid for a specific block ~{}~, which we will discuss later.

#+begin_src java
  public class FluxCapacitor {
    private static final int POWERCONSUMPTION = 2; // MJ
    private int startYear;// = Date.now();
    private int destinationYear = 1955;
    private int requiredPower = 0;

    FluxCapacitor(int theStartYear) { // This is not the most obvious constructor, or indeed the only one needed.
      this.startYear = theStartYear;
      this.setDestinationYear(2015);
    }

    public void setDestinationYear(int theDestinationYear) {
      this.destinationYear=theDestinationYear;

      int tripLength = startYear - destinationYear;
      requiredPower = Math.abs(tripLength * POWERCONSUMPTION);

      theDestinationYear = 1955;
      tripLength = startYear - theDestinationYear;      
    }

    public String toString() {
      return "FluxCapacitor set to " + startYear + " (start) " + destinationYear + " (destination), requiring " + requiredPower + "MJ";
    }

    public static void main(String [] args) {
      FluxCapacitor fc = new FluxCapacitor(1985);
      System.out.println(fc); // Special "Java Magic": any object can be cast to a String. This calls the toString() method.
    }
  }

#+end_src

#+RESULTS:
: FluxCapacitor set to 1985 (start) 2015 (destination), requiring 60MJ

** Pointers or Variables
- The biggest difference between Java and C++ is /pointers/
- They allow direct reference to a memory location
- Used extensively in Object Oriented Programming in C++
- Careful! With great power comes great responsibility
  - It is easy to make mistakes and point to something which no longer exists
  - It is equally easy to forget to clear the memory of an object that is no longer being used

#+begin_src cpp :file pointers.cc :results output
  #include <iostream>

  using namespace std;

  int main(void) {
    int x = 10;
    int *y; // A pointer to an int
    y = &x; // y now points to the address of x;
	
    cout << "We start with " << x << " : " << *y << endl; 
    // We have to de-reference y in order to get the value it points to.

    x = 20;
    cout << "Now we have " << x << " : " << *y << endl;
  }
#+end_src

#+RESULTS:
: We start with 10 : 10
: Now we have 20 : 20
